{
  "blogs": [
    {
      "title": "Ricciardo 'felt good' on first race back after finishing 13th in 'strong showing' at Hungarian GP",
      "body": "Daniel Ricciardo says “he felt good in the car” as he marked his full-time return to the grid with AlphaTauri by finishing 13th at this weekend’s Hungarian Grand Prix – as he also revealed his mindset after being involved in a series of collisions on the opening lap.\n\nAfter half a season on the sidelines serving as the reserve driver for Red Bull, Ricciardo was announced to be driving for AlphaTauri for the rest of the season, starting in Hungary. And he lined up in 13th ahead of his first race since November 20, 2022, in Abu Dhabi..However, as he made his way down to Turn 1, he was hit in the rear by the Alfa Romeo of Zhou Guanyu. This sent Ricciardo into the back of his former team mate Esteban Ocon, knocking the French driver and his fellow Alpine driver, Pierre Gasly, out of the race.Reflecting on the incident, Ricciardo said: “It was a welcome back. I feel like it’s probably like your first NFL game, someone is going to put a big tackle on you to welcome you to the sport. So, I guess it was a version of that.\n\n“Obviously, that was disappointing to just be out of position from the start, with that incident. As soon as I got hit, obviously I knew I was pretty much going to go to the end of the field, the tail. I was immediately obviously disappointed.But the next thought was please don’t have damage. I need to do this race; I need to learn this car. For myself as well, just keep learning and physically, just to do a race distance.”",
      "author": "Frantz",
      "id": 1
    },
    {
      "title": "Alonso and Stroll call on Aston Martin to ‘understand’ recent struggles and ‘fight back’ over second half of season",
      "body": "While Aston Martin logged another double points finish in the Hungarian Grand Prix, drivers Fernando Alonso and Lance Stroll were left wanting more after crossing the line behind rivals Red Bull, McLaren, Mercedes and Ferrari.\n\nAston Martin started the 2023 season in fine form, with Alonso making the podium at six of the first eight races, including P2 results behind championship leader Max Verstappen at the Monaco and Canada rounds..However, the last three events have seen the Silverstone team fall away from the front-running battle, taking fifth and ninth in Austria, seventh and 14th in Britain and ninth and 10th in Hungary over the weekend.Asked if the latest double points finish was satisfying, Alonso said: “You always want more, for sure. We did the maximum, no mistakes today, tried to optimise everything…\n\n“Ninth and 10th was the maximum, but obviously not the best in terms of results, behind McLaren, Ferrari, Mercedes and Red Bull. We need to see how to improve into next week at Spa, another opportunity.”\n\nAsked if he will be pushing the team for more upgrades as the campaign develops, he continued: “Yeah, more grip. From now on, different circuits [are] coming, hopefully better [suited] to our car.“At the moment we are struggling a little bit in the last few races, so [it will be] maximum focus, head down and try to understand why.”\n\nHaving followed Alonso home at the Hungaroring, and been lapped by race winner Verstappen, Stroll offered a similar assessment of Aston Martin’s current form.“It’s been a tough weekend – we just haven’t been quick enough this weekend,” he stated. “We’ve got to find some speed in the car, because we’re just not as competitive as we want to be right now.\n\n“McLaren, Mercedes, Ferrari, they’re quicker than us, and we have to fight our way back to being where we were at the beginning of the season. I believe we can come up with some ideas and bounce back.”",
      "author": "Mike",
      "id": 2
    },
    {
      "title": "Ricciardo ahead of AlphaTauri loan",
      "body": "Red Bull Team Principal Christian Horner has praised the efforts behind the wheel of Daniel Ricciardo, after the Australian lapped for the team at a Silverstone Pirelli test on Tuesday – before a shock call up to AlphaTauri later in the day.\n\nRicciardo had been scheduled to drive in the Pirelli test heading into the Silverstone weekend as part of his third driver duties for Red Bull Racing – with sources revealing to F1.com that the Australian clocked times that would have put him on the front row of the grid for last weekend’s British Grand Prix.\n\nBut events escalated later in the day when AlphaTauri confirmed that Ricciardo would replace Nyck de Vries at the team from the upcoming Hungarian Grand Prix onwards, on loan from Red Bull – with Horner confident that Ricciardo was still as fast as ever behind the wheel despite several months out of the cockpit.“His times during the tyre test were extremely competitive. It was a very impressive drive and we are excited to see what the rest of the season brings for Daniel on loan at Scuderia AlphaTauri.”\n\nRicciardo’s ‘return’ to AlphaTauri – he raced for the team in their Toro Rosso guise in 2012-13 – will also see him reunited with Team Principal Franz Tost. And the Austrian – whose team have scored just two points in 2023 so far – predicted that the team would “profit” from Ricciardo’s experience, while also paying tribute to the out-going De Vries, who drove just 10 races for the team.",
      "author": "Christian",
      "id": 3
    },
    {
      "title": "Pit stop ‘didn’t make much difference’ with Piastri able to take the positives from P5 finish",
      "body": "Oscar Piastri might have started behind his team mate in Hungary, but thanks to a great getaway and a racer’s instinct for picking a gap the Australian found himself running second behind Max Verstappen at the end of the first lap in Budapest.\n\nBut the Australian wound up coming home a distant fifth at the end of an attritional race that saw the whole field need two stops thanks to high levels of tyre degradation. It was in the first pit stop period that Piastri lost out to his team mate with McLaren calling Lando Norris in first. With the undercut proving powerful, the Briton was able to gain enough time on his out-lap to draw level with Piastri as he exited the pit lane – and pull out an easy move on the rookie, whose tyres were not up to temperature.“I think it wasn’t ideal to come out behind Lando [Norris] but when you finish 30 seconds behind him, it didn’t make much difference,” Piastri said afterwards. “I think it was just a lot of tyre management, I couldn’t really do much more to defend. I mean I tried as hard as I could against Checo [Perez] and he was out of sight in about two laps.\n\n“So yeah, some things to review on tyre management but, yeah, overall still a good day for the team and I think Lando’s proven – not so much myself – but that when it’s hot like this we can still stay at the front.”Piastri’s mid-race battle with a recovering Sergio Perez had the crowd on the edge of their seats, the McLaren man doing everything he could to make the Mexican’s life as hard as possible after Perez had overtaken around the outside into Turn 1. Piastri provided some tough opposition, sticking with the RB19 into Turn 2 and even running wide and dipping a wheel on the grass, but ultimately, Perez had too much pace.\n\n“I think if we’d had the old car here we would have been probably a lap behind where we were now,\" said Piastri, referencing those upgrades that have transformed McLaren’s season of late. \"Still a really positive weekend for the team, a good weekend for myself, just a lot to go through, digest and learn from.“Happy to hang on to P5, I thought at one point we were going to be even further back than that.”",
      "author": "Zack",
      "id": 4
    }
  ]
}